# print("My first Python Code!")

'''
py 算术运算符
'''
'''
print(3 + 4)
print(3 - 4)
print(3 * 4)
print(3 // 4)
print(3 % 2)
print(3 ** 4)  # 3 to the fourth power
print(3 // 4)  # floor division
'''
'''
看，它们非常标准。我包括了如何做指数，因为它有点时髦，但除此之外，
它们相当正常并且按预期工作。不要忘记，您可以使用 + 号连接字符串。
加法、减法、乘法和除法的工作方式与预期一样。
您以前可能没有见过模运算符 （%）。模算子所做的只是将左边除以右边并得到余数。
因此，余数是返回的内容，而不是正确数字进入左侧数字的次数 double * 只是向 Python 提供指数的一种简单方法。
最后，楼层除法运算符 （//） 只是将数字除以并向下舍入。
'''
########################################################################
'''
赋值运算符
'''
a = 0
a += 2
print(a)

'''
当然，您可以使用前面的任何算术运算符作为赋值运算符，
后跟 = 我们刚刚告诉 Python 将 2 添加到 a 的值上，
而不必说 a = a + 2 之类的话。
我们是程序员，我们很自豪被称为懒惰！
'''
########################################################################
